<?php
//----------------------------------------------------------
// ■ セッションを開始する
//----------------------------------------------------------
session_start();
?>
<html>
<head>
  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <title>セッションの利用</title>
</head>
<body>
  <b>//----------------------------------------------------------</b><br>
  <b>// ■ セッション を利用する</b><br>
  <b>//----------------------------------------------------------</b><br>
  <?php
  echo "好きな食べ物は「" .$_SESSION["suki"] ."」です♪<p>";
  ?>
  <a href="cookie_session.php">戻る</a><br>
</body>
</html>
